Autodesk.Revit.DB.CurtainSystem.RemoveCurtainGrid(Autodesk.Revit.DB.Reference)
Remove CurtainGrid from the specified face for the CurtainSystem.
face: The face CurtainGrid will be removed from.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input parameter face is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the CurtainGrid cannot be removed from the specified face or regenerate fails.

Autodesk.Revit.DB.CurtainSystem.AddCurtainGrid(Autodesk.Revit.DB.Reference)
Add CurtainGrid on the specified face for the CurtainSystem.
face: The face new CurtainGrid will be created on.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument face is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creating CurtainGrid on the specified face fails or regenerate fails.

Autodesk.Revit.DB.CurtainSystem.CurtainSystemType
get or set the type of the CurtainSystem.
curtainSystemType: The Type of CurtainSystem to be swapped.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter curtainSystemType is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the type of the CurtainSystem cannot be changed to the specified one.

Autodesk.Revit.DB.CurtainSystem.CurtainGrids
Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face.
Returns: A CurtainGrid set  will be returned if the operation succeeds. null will be returned if the
CurtainSystem doesn't include any CurtainGrid.

Autodesk.Revit.DB.CurtainSystem
Provides access to the CurtainSystem object in Autodesk Revit.
Remarks: The user can create CurtainSystem object and change the internal properties.